; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	spectrograph2 - mode
	infrared1 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star9 - direction
	GroundStation7 - direction
	Star1 - direction
	GroundStation11 - direction
	Star8 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star8)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Star15)
	(pointing satellite1 GroundStation2)
	(have_image Star12 thermograph0)
	(have_image Phenomenon13 spectrograph2)
	(have_image Phenomenon14 thermograph0)
	(have_image Star15 spectrograph2)
	(have_image Phenomenon16 thermograph0)
	(have_image Star17 infrared1)
	(have_image Planet18 thermograph0)
))

)

; plan
1. (turn_to satellite1 star8 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star8)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 star8)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 phenomenon13 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 9
5. (turn_to satellite0 groundstation7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 9
6. (take_image satellite1 phenomenon13 instrument3 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 1 of 9
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
8. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 1 of 9
9. (turn_to satellite0 phenomenon14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 9
10. (take_image satellite0 phenomenon14 instrument0 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 2 of 9
11. (turn_to satellite0 phenomenon16 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 9
12. (take_image satellite0 phenomenon16 instrument0 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 3 of 9
13. (turn_to satellite0 planet18 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet18)
   goals met: 3 of 9
14. (take_image satellite0 planet18 instrument0 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 4 of 9
15. (turn_to satellite0 star12 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star12)
   goals met: 4 of 9
16. (take_image satellite0 star12 instrument0 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 5 of 9
17. (turn_to satellite0 star17 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star17)
   goals met: 5 of 9
18. (take_image satellite0 star17 instrument0 infrared1)
   added: (have_image star17 infrared1)
   goals met: 6 of 9
19. (turn_to satellite0 star15 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star15)
   goals met: 7 of 9
20. (turn_to satellite1 star15 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star15)
   goals met: 7 of 9
21. (take_image satellite1 star15 instrument3 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 8 of 9
22. (turn_to satellite1 groundstation2 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 groundstation2)
   goals met: 9 of 9
